esp32m/core/esp32m/src/io/gpio.cpp
#include "esp32m/io/gpio.hpp"
#include "esp32m/defs.hpp"
#include "esp32m/io/pins.hpp"
#include "esp32m/io/utils.hpp"

#include <driver/dac_oneshot.h>
#include <driver/gpio.h>
#include <driver/pulse_cnt.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_clk_tree.h>
#include <esp_timer.h>
#include <limits.h>
#include <sdkconfig.h>
#include <soc/sens_periph.h>
#include <string.h>
#include <mutex>
#if SOC_DAC_SUPPORTED
#  include <soc/dac_channel.h>
#endif

#if SOC_CLK_RC_FAST_SUPPORT_CALIBRATION
#  define LEDC_CLK_SRC_FREQ_PRECISION ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED
#else
#  define LEDC_CLK_SRC_FREQ_PRECISION ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX
#endif

#define DEFAULT_VREF \
  1100  // Use adc2_vref_to_gpio() to obtain a better
        // estimate

namespace esp32m {
  namespace gpio {

    using namespace io;

    class ISRArg;

    class Pin : public IPin {
     public:
      Pin(int id);
      const char *name() const override {
        return _name;
      }
      gpio_num_t num();
      pin::Flags flags() override {
        return _features;
      }
      void reset() override;

     protected:
      esp_err_t createFeature(pin::Type type, pin::Feature **feature) override;

     private:
      pin::Flags _features;
      char _name[5];
    };

    class Digital : public pin::IDigital {
     public:
      Digital(Pin *pin) : _pin(pin) {}
      ~Digital() override {
        detach();
        ESP_ERROR_CHECK_WITHOUT_ABORT(gpio_reset_pin(_pin->num()));
      }

      /*esp_err_t setDirection(gpio_mode_t mode) override {
        return gpio_set_direction(_pin->num(), mode);
      }
      esp_err_t setPull(gpio_pull_mode_t pull) override {
        return gpio_set_pull_mode(_pin->num(), pull);
      }*/
      esp_err_t setMode(pin::Mode mode) override {
        mode = deduce(mode, _pin->flags());
        auto dir = GPIO_MODE_DEF_DISABLE;
        if ((mode & pin::Mode::Input) != 0)
          dir |= GPIO_MODE_DEF_INPUT;
        if ((mode & pin::Mode::Output) != 0) {
          dir |= GPIO_MODE_DEF_OUTPUT;
          if ((mode & pin::Mode::OpenDrain) != 0)
            dir |= GPIO_MODE_DEF_OD;
        }
        ESP_CHECK_RETURN(gpio_set_direction(_pin->num(), (gpio_mode_t)dir));
        gpio_pull_mode_t pull;
        switch (mode & pin::Mode::PullUpDown) {
          case pin::Mode::PullUp:
            pull = GPIO_PULLUP_ONLY;
            break;
          case pin::Mode::PullDown:
            pull = GPIO_PULLDOWN_ONLY;
            break;
          case pin::Mode::PullUpDown:
            pull = GPIO_PULLUP_PULLDOWN;
            break;
          default:
            pull = GPIO_FLOATING;
            break;
        }
        ESP_CHECK_RETURN(gpio_set_pull_mode(_pin->num(), pull));
        _mode = mode;
        return ESP_OK;
      }

      esp_err_t read(bool &value) override {
        value = gpio_get_level(_pin->num()) != 0;
        return ESP_OK;
      }
      esp_err_t write(bool value) override {
        return gpio_set_level(_pin->num(), value);
      }
      esp_err_t attach(QueueHandle_t queue, gpio_int_type_t type) override;
      esp_err_t detach() override;

     private:
      Pin *_pin;
      ISRArg *_isr = nullptr;
      friend class ISRArg;
    };

    class ISRArg {
     public:
      ISRArg(Digital *pin, QueueHandle_t queue) : _pin(pin), _queue(queue) {
        _num = pin->_pin->num();
        _stamp = esp_timer_get_time();
        _level = gpio_get_level(_num) != 0;
      }

     private:
      Digital *_pin;
      gpio_num_t _num;
      QueueHandle_t _queue;
      bool _level;
      int64_t _stamp;
      friend IRAM_ATTR void gpio_isr_handler(void *self);
    };

    namespace adc {
      class Unit;
      static adc_cali_scheme_ver_t calischeme = (adc_cali_scheme_ver_t)0;
      static std::map<adc_unit_t, std::unique_ptr<Unit> > _units;

      enum Flags {
        None = 0,
        Dirty = BIT0,
        CharsDirty = BIT1,
      };

      ENUM_FLAG_OPERATORS(Flags)

      class Unit {
       public:
        Unit(const Unit &) = delete;
        ~Unit() {
          ESP_ERROR_CHECK_WITHOUT_ABORT(adc_oneshot_del_unit(_handle));
        }
        static esp_err_t claim(adc_unit_t unit, Unit **u) {
          if (!u)
            return ESP_ERR_INVALID_ARG;
          Unit *result = nullptr;
          auto it = _units.find(unit);
          if (it == _units.end()) {
            adc_oneshot_unit_init_cfg_t ucfg = {
                .unit_id = unit,
                .clk_src = (adc_oneshot_clk_src_t)0,
                .ulp_mode = ADC_ULP_MODE_DISABLE};
            adc_oneshot_unit_handle_t handle;
            ESP_CHECK_RETURN(adc_oneshot_new_unit(&ucfg, &handle));
            result = new Unit(unit, handle);
            _units[unit] = std::unique_ptr<Unit>(result);
          } else
            result = it->second.get();
          result->_refs++;
          *u = result;
          return ESP_OK;
        }
        void release() {
          if (_refs <= 0) {
            logw("invalid ADC unit release, %d refs", _refs);
            return;
          }
          _refs--;
          if (_refs == 0)
            _units.erase(_unit);
        }
        std::mutex &mutex() {
          return _mutex;
        }
        adc_oneshot_unit_handle_t handle() const {
          return _handle;
        }
        adc_unit_t unit() const {
          return _unit;
        }

       private:
        int _refs = 0;
        adc_unit_t _unit;
        adc_oneshot_unit_handle_t _handle;
        std::mutex _mutex;
        Unit(adc_unit_t unit, adc_oneshot_unit_handle_t handle)
            : _unit(unit), _handle(handle) {}
      };

    }  // namespace adc

    class ADC : public pin::IADC {
     public:
      ~ADC() override {
        _unit->release();
      }
      esp_err_t read(int &value, uint32_t *mv) override {
        ESP_CHECK_RETURN(update());
        {
          std::lock_guard guard(_unit->mutex());
          ESP_CHECK_RETURN(adc_oneshot_read(_unit->handle(), _channel, &value));
        }
        if (mv) {
          if (!_calihandle || (_flags & adc::Flags::CharsDirty) != 0) {
            _flags &= ~adc::Flags::CharsDirty;
            if (_calihandle) {
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
              if ((adc::calischeme & ADC_CALI_SCHEME_VER_LINE_FITTING) != 0)
                adc_cali_delete_scheme_line_fitting(_calihandle);
#endif
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
              if ((adc::calischeme & ADC_CALI_SCHEME_VER_CURVE_FITTING) != 0)
                adc_cali_delete_scheme_curve_fitting(_calihandle);
#endif
            }
            _calihandle = nullptr;

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
            if ((adc::calischeme & ADC_CALI_SCHEME_VER_LINE_FITTING) != 0) {
              adc_cali_line_fitting_config_t cali_config = {};
              cali_config.unit_id = _unit->unit();
              cali_config.atten = _atten;
              cali_config.bitwidth = _width;
              cali_config.default_vref = DEFAULT_VREF;
              ESP_CHECK_RETURN(adc_cali_create_scheme_line_fitting(
                  &cali_config, &_calihandle));
            }
#endif
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
            if (!_calihandle &&
                (adc::calischeme & ADC_CALI_SCHEME_VER_CURVE_FITTING) != 0) {
              adc_cali_curve_fitting_config_t cali_config = {};
              cali_config.unit_id = _unit->unit();
              cali_config.atten = _atten;
              cali_config.bitwidth = _width;
              ESP_CHECK_RETURN(adc_cali_create_scheme_curve_fitting(
                  &cali_config, &_calihandle));
            }
#endif
          }
          if (_calihandle) {
            int v;
            ESP_CHECK_RETURN(adc_cali_raw_to_voltage(_calihandle, value, &v));
            *mv = (uint32_t)v;
          }
        }
        return ESP_OK;
      }
      esp_err_t range(int &min, int &max, uint32_t *mvMin = nullptr,
                      uint32_t *mvMax = nullptr) override {
        min = 0;
        auto width = getWidth();
        if (width <= 0)
          return ESP_FAIL;
        max = (1 << width) - 1;
#if CONFIG_IDF_TARGET_ESP32S2
        if (mvMin || mvMax) {
          if (mvMin)
            *mvMin = 0;
          if (mvMax)
            switch (_atten) {
              case ADC_ATTEN_DB_0:
                *mvMax = 750;
                break;
              case ADC_ATTEN_DB_2_5:
                *mvMax = 1050;
                break;
              case ADC_ATTEN_DB_6:
                *mvMax = 1300;
                break;
              case AdcAttenDefault:
                *mvMax = 2500;
                break;
              default:
                return ESP_FAIL;
            }
        }
#else
        if (mvMin || mvMax)
          switch (_atten) {
            case ADC_ATTEN_DB_0:
              if (mvMin)
                *mvMin = 100;
              if (mvMax)
                *mvMax = 950;
              break;
            case ADC_ATTEN_DB_2_5:
              if (mvMin)
                *mvMin = 100;
              if (mvMax)
                *mvMax = 1250;
              break;
            case ADC_ATTEN_DB_6:
              if (mvMin)
                *mvMin = 150;
              if (mvMax)
                *mvMax = 1750;
              break;
            case AdcAttenDefault:
              if (mvMin)
                *mvMin = 150;
              if (mvMax)
                *mvMax = 2450;
              break;
            default:
              return ESP_FAIL;
          }
#endif
        return ESP_OK;
      }
      adc_atten_t getAtten() override {
        return _atten;
      }
      esp_err_t setAtten(adc_atten_t atten) override {
        if (atten == _atten)
          return ESP_OK;
        _atten = atten;
        _flags |= adc::Flags::CharsDirty | adc::Flags::Dirty;
        return ESP_OK;
      }
      int getWidth() override {
        return _width == ADC_BITWIDTH_DEFAULT ? SOC_ADC_RTC_MAX_BITWIDTH
                                              : _width;
      }

      esp_err_t setWidth(adc_bitwidth_t width) override {
        if (width == _width)
          return ESP_OK;
        _width = width;
        _flags |= adc::Flags::CharsDirty | adc::Flags::Dirty;
        return ESP_OK;
      }

      static esp_err_t create(Pin *pin, pin::Feature **feature) {
        if (!adc::calischeme)
          ESP_ERROR_CHECK_WITHOUT_ABORT(
              adc_cali_check_scheme(&adc::calischeme));
        adc_unit_t unit;
        adc_channel_t channel;
        ESP_CHECK_RETURN(
            adc_oneshot_io_to_channel(pin->num(), &unit, &channel));
        adc::Unit *u = nullptr;
        ESP_CHECK_RETURN(adc::Unit::claim(unit, &u));
        *feature = new ADC(pin, u, channel);
        /*logd("initialized oneshot ADC on gpio %d, ADC%d, channel %d",
             _pin->num(), _unit + 1, _channel);*/
        return ESP_OK;
      }

