esp32m/core/esp32m/src/io/gpio.cpp
     private:
      Pin *_pin;
#if SOC_LEDC_SUPPORT_HS_MODE
      ledc_mode_t _speedMode = LEDC_HIGH_SPEED_MODE;
#else
      ledc_mode_t _speedMode = LEDC_LOW_SPEED_MODE;
#endif
      ledc_channel_t _channel;
      int _timer = -1;

      LEDC(Pin *pin, ledc_channel_t channel) : _pin(pin), _channel(channel) {}
    };

    Pin::Pin(int id) : IPin(id) {
      gpio_num_t num = this->num();
      snprintf(_name, sizeof(_name), "IO%02u", num);
      _features = pin::Flags::Input | pin::Flags::PulseCounter;
      if (GPIO_IS_VALID_DIGITAL_IO_PAD(num))
        _features |= pin::Flags::PAD;
      if (GPIO_IS_VALID_OUTPUT_GPIO(num))
        _features |= pin::Flags::Output | pin::Flags::PullUp |
                     pin::Flags::OpenDrain | pin::Flags::PullDown |
                     pin::Flags::LEDC;
#if SOC_DAC_SUPPORTED
      if (num == DAC_CHANNEL_1_GPIO_NUM || num == DAC_CHANNEL_2_GPIO_NUM)
        _features |= pin::Flags::DAC;
#endif
      adc_unit_t unit;
      adc_channel_t channel;
      if (adc_oneshot_io_to_channel(num, &unit, &channel) == ESP_OK)
        _features |= pin::Flags::ADC;
    };
    gpio_num_t Pin::num() {
      return (gpio_num_t)_id;
    }

    void Pin::reset() {
      ESP_ERROR_CHECK_WITHOUT_ABORT(gpio_reset_pin(num()));
      IPin::reset();
    };

    void IRAM_ATTR gpio_isr_handler(void *self) {
      int64_t stamp = esp_timer_get_time();
      auto arg = (ISRArg *)self;
      bool level = gpio_get_level(arg->_num) != 0;
      if (arg->_level == level)
        return;
      int64_t diff = stamp - arg->_stamp;
      if (diff > 0x7FFFFFFF)
        diff = 0x7FFFFFFF;
      if (level)
        diff = -diff;
      arg->_level = level;
      arg->_stamp = stamp;
      BaseType_t high_task_wakeup = pdFALSE;
      xQueueSendFromISR(arg->_queue, &diff, &high_task_wakeup);
      if (high_task_wakeup != pdFALSE)  // TODO: should we do this? many
                                        // examples seem to work without it
        portYIELD_FROM_ISR();
    }

    esp_err_t Digital::attach(QueueHandle_t queue, gpio_int_type_t type) {
      if (!queue)
        return ESP_FAIL;
      std::lock_guard guard(_pin->mutex());
      if (_isr)
        return ESP_ERR_INVALID_STATE;
      esp_err_t err = gpio_install_isr_service(0);
      if (err != ESP_ERR_INVALID_STATE)
        ESP_CHECK_RETURN(err);
      auto num = _pin->num();
      gpio_config_t gpio_conf;
      gpio_conf.intr_type = type;
      gpio_conf.mode = GPIO_MODE_INPUT;
      gpio_conf.pin_bit_mask = (1ULL << num);
      gpio_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
      gpio_conf.pull_up_en = GPIO_PULLUP_ENABLE;
      gpio_config(&gpio_conf);

      // ESP_CHECK_RETURN(gpio_set_intr_type(num(), type));
      // ESP_CHECK_RETURN(gpio_intr_enable(num()));
      _isr = new ISRArg(this, queue);
      err = gpio_isr_handler_add(num, gpio_isr_handler, _isr);
      if (err != ESP_OK) {
        delete _isr;
        _isr = nullptr;
        return err;
      }
      return ESP_OK;
    }

    esp_err_t Digital::detach() {
      std::lock_guard guard(_pin->mutex());
      auto n = _pin->num();
      ESP_CHECK_RETURN(gpio_intr_disable(n));
      if (!_isr)
        return ESP_ERR_INVALID_STATE;
      ESP_CHECK_RETURN(gpio_isr_handler_remove(n));
      delete _isr;
      _isr = nullptr;
      return ESP_OK;
    }

    esp_err_t Pin::createFeature(pin::Type type, pin::Feature **feature) {
      switch (type) {
        case pin::Type::Digital:
          if ((_features & (pin::Flags::Input | pin::Flags::Output)) != 0) {
            *feature = new gpio::Digital(this);
            return ESP_OK;
          }
          break;
        case pin::Type::PWM:
          if ((flags() & pin::Flags::Output) != 0) {
            if (gpio::PWM::create(this, feature) == ESP_OK)
              return ESP_OK;
          }
          break;
        case pin::Type::ADC:
          if ((_features & pin::Flags::ADC) != 0) {
            gpio::ADC::create(this, feature);
            return ESP_OK;
          }
          break;
#if SOC_DAC_SUPPORTED
        case pin::Type::DAC:
          if ((_features & pin::Flags::DAC) != 0) {
            gpio::DAC::create(this, feature);
            return ESP_OK;
          }
          break;
#endif
        case pin::Type::Pcnt:
          if ((_features & pin::Flags::PulseCounter) != 0) {
            gpio::Pcnt::create(this, feature);
            return ESP_OK;
          }
          break;
        case pin::Type::LEDC:
          if ((_features & pin::Flags::Output) != 0) {
            gpio::LEDC::create(this, feature);
            return ESP_OK;
          }
          break;
        default:
          break;
      }
      return IPin::createFeature(type, feature);
    }
  }  // namespace gpio

  namespace io {
    IPin *Gpio::newPin(int id) {
      if (GPIO_IS_VALID_GPIO(id))
        return new gpio::Pin(id);
      return nullptr;
    }

    Gpio &Gpio::instance() {
      static Gpio i;
      return i;
    }

    Gpio::Gpio() {
      init(GPIO_NUM_MAX);
    }
  }  // namespace io

  namespace gpio {
    io::IPin *pin(gpio_num_t n) {
      return io::Gpio::instance().pin(n);
    }

    /*adc_oneshot_unit_handle_t adc_handles[] = {nullptr, nullptr};
    std::map<adc_unit_t, std::mutex> _adc_locks;

    esp_err_t getADCUnitHandle(adc_unit_t unit,
                               adc_oneshot_unit_handle_t *handle) {
      auto h = adc_handles[unit];
      if (!h) {
        adc_oneshot_unit_init_cfg_t ucfg = {.unit_id = unit,
                                            .clk_src =
    (adc_oneshot_clk_src_t)0, .ulp_mode = ADC_ULP_MODE_DISABLE};
        ESP_CHECK_RETURN(adc_oneshot_new_unit(&ucfg, &h));
        adc_handles[unit] = h;
      }
      *handle = h;
      return ESP_OK;
    }

    std::mutex &getADCUnitMutex(adc_unit_t unit) {
      auto it = _adc_locks.find(unit);
      if (it != _adc_locks.end())
        return it->second;
      return _adc_locks[unit];
    }*/

  }  // namespace gpio
}  // namespace esp32m